
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/ptf-backends/actions/runs/13267055227)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.current: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e70a1ca0d5050729]
module.vpc.data.aws_availability_zones.current: Read complete after 1s [id=ap-northeast-1]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-089f71019d0076d86]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-013d204d17bce1019]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ed9eafe9c05f31e7]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0332579f5732345b6]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-083d7f2903593da0e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08eaec587b68a937c]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ab97b6f5439f5667]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d424d33830b09476]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-024736e2160f50ea3]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c615e8208bbadbb1]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0465476ea7c8fed10]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d9d1eaebace2541c]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0356792a25ecb8a58]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-033e6a49ca49e1962]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03669c6ad1b635ce9]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ab97b6f5439f56671080289494]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-07f5166d647f0c7cc]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-013d204d17bce10191080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "ptf-golang-app"
    }

  # module.ecr.aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "ptf-golang-app"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.ecr.aws_ecr_repository.ecr_repository: Creating...
module.ecr.aws_ecr_repository.ecr_repository: Creation complete after 1s [id=ptf-golang-app]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=ptf-golang-app]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"ab3f706b76067b96fafc32c2e7e4ebe0f494eafe","Vars":{},"WorkflowName":"Terraform"} -->